app/controllers/articles_controller.rb

  def create
    @article = Article.create!(article_params2)
---
INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2020-02-03 22:29:16.691480"], ["updated_at", "2020-02-03 22:29:16.691480"]]

  def update
    article = Article.find_by_id(params[:id])
    article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2020-02-04 00:49:05.329884"], ["id", 1]]